W10D4/myreddit/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdfghjk"], ["description", "asdfghjkl"], ["moderator_id", 10], ["created_at", "2020-01-31 00:33:18.547661"], ["updated_at", "2020-01-31 00:33:18.547661"]]
---
  def create
    ensure_logged_in?
    @sub = Sub.new(sub_params)
    @sub.moderator_id = current_user.id

    if @sub.save