W10D1/myMusicApp/app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)
    p album_params
    if @album.save
---
INSERT INTO "albums" ("band_id", "title", "year", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 1], ["title", "Best Album"], ["year", 2018], ["live", true], ["created_at", "2020-01-28 00:11:20.696892"], ["updated_at", "2020-01-28 00:11:20.696892"]]

  def update
    @album = Album.find(params[:id])

    if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "albums" SET "live" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["live", false], ["updated_at", "2020-01-28 00:32:11.565750"], ["id", 4]]