W10D1/myMusicApp/app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 1]]
---

<% if @album.tracks.length > 0 %>